<?php
namespace Idane\ProductParser\Parsers;
use Idane\ProductParser\ProductXMLParser;

class Victory extends ProductXMLParser
{
    const CHAIN_NAME = "ויקטורי";
    const ROOT_ALIAS = 'Prices';
    const PRODUCT_ALIAS = "Product";
    const PRODUCTS_ALIAS = "Products";
    const CHAINID_ALIAS = "ChainID";
    const STOREID_ALIAS = "StoreID";
    // Victory are somewhat inconsistent with their store ids, some store ids have no XMLs under them, and a few 'borrow' their ids
    // other stores
    const STORES = [
        '1' => 'ב\"ש-בית אשל',
        '11' => ' עין יהב',
        '15' => ' שכונה ט',
        '20' => 'להבים',
        '30' => 'נווה זאב',
        '35' => 'שלומי',
        '40' => 'אופקים',
        '45' => 'רעננה',
        '50' => 'רד\"ק',
        '51' => 'נשר',
        '55' => ' יד בנימין',
        '56' => 'אשדוד סנטר',
        '58' => 'אורגים רכבת',
        '59' => 'יוקנעם',
        '60' => 'דימונה',
        '65' => 'קרית אתא',
        '70' => 'אורגים',
        '71' => 'קריית מלאכי',
        '72' => 'אשדוד הפלמ\"ח (ג)',
        '75' => 'טבריה הדר',
        '76' => 'צפת',
        '77' => 'קרית גת',
        '80' => 'המשחררים',
        '81' => 'מבצע עובדה- מצדה',
        '91' => 'זבוטינסקי',
        '98' => 'אילת',
        '61' => 'אוניברסיטה ת\"א',
        '47' => 'אופקים',
        '05' => 'אורנית',
        '97' => 'אינטרנט',
        '08' => 'אשדוד',
        '10' => 'אשדוד',
        '18' => 'אשדוד 18 מהדרין',
        '52' => 'אשקלון',
        '95' => 'אשקלון בן גוריון',
        '06' => 'אשקלון מכללה',
        '68' => 'באר שבע',
        '73' => 'בית שאן',
        '14' => 'בית שמש',
        '12' => 'בני ברק',
        '41' => 'ברנע',
        '02' => 'גדרה',
        '01' => 'גן-יבנה ויקטורי',
        '28' => 'גני תקווה',
        '46' => 'דימונה',
        '86' => 'טבעון',
        '36' => 'כפר-סבא',
        '85' => 'כצנלסון',
        '07' => 'לב אשדוד',
        '44' => 'לינקולן תל אביב',
        '03' => 'מודיעין',
        '34' => 'מוצקין',
        '90' => 'נתניה',
        '25' => 'עכו',
        '16' => 'פלורנטין',
        '63' => 'ציק פוסט',
        '09' => 'קרית גת',
        '54' => 'קרית מלאכי',
        '26' => 'ראש העין',
        '23' => 'ראשון לציון',
        '43' => 'רכסים',
        '04' => 'רמות',
        '78' => 'רמלה',
        '53' => 'רמת ישי',
        '74' => 'שבעת הכוכבים',
        '32' => 'תחנה מרכזית ת\"א',
        '62' => 'תל-אביב'
    ];
}